export const riskyExercises: Record<string, string[]> = {
    "دیسک کمر": [
        "ددلیفت کلاسیک (Deadlift)",
        "اسکات هالتر از پشت (Squat)",
        "زیربغل هالتر خم (Barbell Row)",
        "سلام ژاپنی (Good Morning)",
        "ددلیفت رومانیایی (RDL)",
        "ددلیفت سومو (Sumo Deadlift)",
        "فیله کمر دستگاه (Back Extension)"
    ],
    "دیسک گردن": [
        "پرس سرشانه هالتر نظامی (Military Press)",
        "شراگ هالتر (Barbell Shrug)",
        "کول هالتر دست باز (Upright Row)",
        "پرس سرشانه هالتر از پشت (Behind-Neck Military Press)",
        "زیربغل سیم‌کش از پشت سر (Behind-Neck Lat Pulldown)"
    ],
    "زانو درد": [
        "جلو ران دستگاه (Leg Extension)",
        "لانگ دمبل (DB Lunges)",
        "اسکات عمیق",
        "اسکات با وزن زیاد",
        "پرس پا با زاویه بسته",
        "هاک پا با زاویه بسته"
    ],
    "شانه درد": [
        "پرس سرشانه هالتر نظامی (Military Press)",
        "پارالل (Dips)",
        "زیربغل سیم‌کش از پشت سر",
        "پرس سرشانه هالتر از پشت (Behind-Neck Military Press)",
        "نشر از جلو با زاویه نامناسب",
        "فلای معکوس با فرم نامناسب"
    ],
    "آرنج درد": [
        "جلو بازو لاری (Preacher Curl)",
        "پشت بازو هالتر خوابیده (Skullcrusher)",
        "دیپ نیمکت (Bench Dip)",
        "جلو بازو با فرم نامناسب",
        "پشت بازو با فرم نامناسب"
    ],
    "مچ درد": [
        "جلو بازو با میله صاف",
        "پشت بازو با میله صاف",
        "شراگ با فرم نامناسب",
        "کول با فرم نامناسب"
    ]
};
